[
	{
		"title": "FirstEncounter",
		"tags": "",
		"body": "If it isn't the daring adventurer.\n*the pony does a swoon gesture*\nGoing out into the forest, daring all that danger, oh the horrors you must encounter.\n-> Oh yes, You would not belive it even if I told you.\n    Oh I am not sure I could handle the truth anyway.\n    I am Daisy, resident florist here in ponyville along with my friends Roseluck and Lily Valley. And I very much enjoy the relative peace and quiet our town can afford.\n    But I am glad that there is ponies such as yourself out there keeping it that way.\n-> Exuce me, do I know you?\n    Pardon me, I am Daisy, resident florist here in ponyville along with my friends Roseluck and Lily Valley.\nNow if you are heading out there again this day, may I make a small request?\n-> I am all ears.\n-> (Oh here we go again...)\n-> For such a pretty mare, anything.\nIts a Disaster! You see, There is this banque this evening, but we are all out of Purple! And the only new flowers can be picked can be picked in the Everfree Forest!\nPlease would you be my hero and pick up as many flowers as you can out there and bring them to me before the evening.\n-> Consider it done.\n    Oh thank you thank you thank you!\n-> Um...  I dont know.\n    I'll give you 100 bits!\n    -> Deal!\n    -> Maybe if i walk past some, no promises.\n-> My standard rate is 50 bits per hour.\n    ..how about 100 bits and my eternal gratude?\n    -> That would work.\n    -> Maybe if i walk past some, no promises.\n<<set $flag.daisy.quest1.started to true>>",
		"position": {
			"x": 79,
			"y": 329
		},
		"colorID": 0
	},
	{
		"title": "Start",
		"tags": "",
		"body": "<<if $flag.daisy.quest1.started is true>>\nHow is it going? You got the flowers yet?\n-> Yes, here they are.\n    [[TurnIn]]\n-> I am afraid not. But don't lose hope.\n    I belive in you!\n    I need them before the evening.\n-> I am sorry, but I could not do it.\n    Oh no!\n    *Daisy faints*\n<<else>>\n[[FirstEncounter]]\n<<endif>>",
		"position": {
			"x": 501,
			"y": 100
		},
		"colorID": 0
	},
	{
		"title": "TurnIn",
		"tags": "",
		"body": "Oh. that you did!\nThank you so much!\n<<take purple flower>>\n<<take purple flower>>\n<<take purple flower>>\n<<take purple flower>>\n<<take purple flower>>\n<<set $flag.daisy.quest1.completed to true>>\nAnd of course, here is 100 bits for all your trouble.\n<<give bits 100>>\nYou are my hero!",
		"position": {
			"x": 397,
			"y": 421
		},
		"colorID": 0
	}
]